The assembly instance could not acquire the assembly views.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CouldNotAcquireAssemblyViews { get; }
  Visual Basic
Public Shared ReadOnly Property CouldNotAcquireAssemblyViews As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CouldNotAcquireAssemblyViews {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AssemblyFailures Class
  Autodesk.Revit.DB Namespace